-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Feb 15, 2025 at 02:20 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `books`
--

-- --------------------------------------------------------

--
-- Table structure for table `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `info` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `books`
--

INSERT INTO `books` (`id`, `name`, `info`) VALUES
(1, 'Голодні ігри', 'У майбутньому Панемі влада змушує кожен із 12-ти округів відправляти підлітків на криваве реаліті-шоу – Голодні ігри. Коли 16-річна Кітнісс Евердін добровільно стає учасницею, вона не підозрює, що її боротьба за життя перетвориться на символ повстання.'),
(2, '1984', 'Жорстокий світ тоталітарного майбутнього, де Великий Брат стежить за кожним. Вінстон Сміт працює у Міністерстві правди, переписуючи історію на догоду партії, але він прагне свободи думки. Його спроба повстати може коштувати йому всього.'),
(3, 'Майстер і Маргарита', 'Сатиричний роман, що переплітає містичну історію про відвідини Москви Воландом і його почтом із біблійною лінією про Понтія Пілата. Кохання Майстра та Маргарити стає символом сили мистецтва і людської душі перед обличчям системи.Жорстокий світ тоталітарного майбутнього, де Великий Брат стежить за кожним. Вінстон Сміт працює у Міністерстві правди, переписуючи історію на догоду партії, але він прагне свободи думки. Його спроба повстати може коштувати йому всього.'),
(4, 'Я (Романтика)', 'Психологічна новела, що розкриває трагедію революціонера, який, захоплений ідеєю боротьби, змушений знищувати навіть найближчих людей. Це розповідь про втрату людяності заради фанатичних ідеалів.'),
(5, 'Тінь вітра', 'У повоєнній Барселоні юний Даніель Семпере знаходить загадкову книгу «Тінь вітру» і намагається дізнатися більше про її автора. Розплутуючи таємниці минулого, він відкриває темну історію кохання, зради та смертельної небезпеки.'),
(6, 'Пікнік на узбіччі', 'Зона – таємнича місцина, де після візиту інопланетян залишилися дивні артефакти. Сміливці-сталкери проникають туди в пошуках скарбів, ризикуючи життям. Головний герой Редрік Шухарт стикається з вибором між багатством і людською совістю.'),
(7, 'Вбити пересмішника', 'Роман про расизм, справедливість і дитячу невинність. Маленька Джин-Луїза «Скаут» Фінч спостерігає, як її батько, адвокат Аттікус, захищає несправедливо звинуваченого темношкірого чоловіка в американському Півдні 1930-х років.');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
